In [6]:
import pandas as pd

In [7]:
customers = pd.read_csv('data/dataset-customers.csv', sep = ';')

In [8]:
customers

           id  age   segment vintage_group
0     CC25034   35   Diamond           VG1
1     CC59625   22   Diamond           VG1
2     CC69314   33   Diamond           VG1
3     CC67036   46   Diamond           VG1
4     CC25597   44   Diamond           VG1
...       ...  ...       ...           ...
5669  CC53430   27  Platinum           VG2
5670  CC31823   33  Platinum           VG2
5671  CC15335   28  Platinum           VG2
5672  CC81556   26  Platinum           VG2
5673  CC38634   21  Platinum           VG2

[5674 rows x 4 columns]

In [9]:
customers.drop_duplicates(subset= ['id'], keep= 'first')

           id  age   segment vintage_group
0     CC25034   35   Diamond           VG1
1     CC59625   22   Diamond           VG1
2     CC69314   33   Diamond           VG1
3     CC67036   46   Diamond           VG1
4     CC25597   44   Diamond           VG1
...       ...  ...       ...           ...
5669  CC53430   27  Platinum           VG2
5670  CC31823   33  Platinum           VG2
5671  CC15335   28  Platinum           VG2
5672  CC81556   26  Platinum           VG2
5673  CC38634   21  Platinum           VG2

[5674 rows x 4 columns]

In [13]:
average_age = round(customers['age'].mean(),2)

In [14]:
average_age

35.06

In [15]:
print('A média de idade dos clientes registrados é de: {}'.format(average_age))

A média de idade dos clientes registrados é de: 35.06